app/controllers/reviews_controller.rb

  def create
   @review = Review.create(review_params)
---
INSERT INTO "reviews" ("email", "rating", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["email", "Thomaslvermeersch@gmail.com"], ["rating", 3], ["comment", "hello"], ["created_at", "2018-02-02 08:48:21.514849"], ["updated_at", "2018-02-02 08:48:21.514849"]]

  def show
    @review = Review.where(movie_id: params[:id])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."movie_id" IS NULL LIMIT ?  [["LIMIT", 1]]

  def destroy
   @review = Review.destroy(params[:id])
---
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 8]]